{
  "backend/main.mo": "Motoko actor defining the backend with types and methods for contact messages, daily analytics (visitor/tool usage tracking), and blog posts (add, filter by category, sort by date).",
  "feature_evidence.json": "Feature evidence report confirming implementation of the 'Change Password' subsection in the admin dashboard Settings tab, with validation and dark-theme styling.",
  "frontend-file-summaries.txt": "JSON map of short summaries for all frontend source files, describing each page, hook, and context component's purpose and notable fixes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme design tokens (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the React app, titled 'Free Online Image & PDF Tools'.",
  "frontend/src/App.tsx": "Main React app file that sets up TanStack Router with lazy-loaded routes for all tool pages, legal pages, blog, and admin panel, wrapped in AuthProvider with shared Layout components.",
  "frontend/src/components/ads/AdBanner.tsx": "Reusable ad banner placeholder component that renders a styled div with configurable width, height, and label for future Google AdSense integration.",
  "frontend/src/components/ads/PopupAd.tsx": "Popup ad component that appears after a 5-second delay with a dismissible overlay, containing a 300×250 AdSense placeholder.",
  "frontend/src/components/ads/StickyBottomAd.tsx": "Sticky bottom banner ad component fixed to the viewport bottom with a 728×60 AdSense placeholder and a close button.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand info, popular tool links, legal/company links, resources section, hashtag cloud, and copyright bar using TanStack Router Link components.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with logo, desktop navigation links, an AdSense leaderboard banner, and a collapsible mobile menu.",
  "frontend/src/components/seo/Breadcrumb.tsx": "Renders an accessible breadcrumb navigation trail, automatically prepending a Home item to the provided list of items.",
  "frontend/src/components/seo/FAQSection.tsx": "Displays a list of FAQ items in a collapsible accordion UI under a configurable section heading.",
  "frontend/src/components/seo/SEOHead.tsx": "Imperatively sets document title, meta tags (Open Graph, Twitter), canonical link, and JSON-LD schema scripts via React effects.",
  "frontend/src/components/tools/ImageToolTemplate.tsx": "Page layout template for image tools that wires up SEO, breadcrumbs, ads, FAQ, and related tools around a child tool UI in a two-column grid.",
  "frontend/src/components/tools/MultiFileUploadZone.tsx": "Drag-and-drop upload zone supporting multiple file selection with a removable file list, capped at a configurable maximum number of files.",
  "frontend/src/components/tools/PdfToolTemplate.tsx": "Page layout template for PDF tools, structurally identical to ImageToolTemplate but categorizes the schema as a BusinessApplication.",
  "frontend/src/components/tools/RelatedTools.tsx": "Renders a grid of linked cards for related tools, each showing the tool's icon, name, and description.",
  "frontend/src/components/tools/ToolUploadZone.tsx": "Single-file drag-and-drop upload zone with a click-to-browse fallback, supporting both image and PDF file types.",
  "frontend/src/contexts/AuthContext.tsx": "Provides a React context for admin authentication with login, logout, and credential/password change functionality, storing state in sessionStorage with hardcoded default credentials.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackgroundRemoval.ts": "Custom hook that removes a background color from an image using canvas pixel manipulation with a configurable color tolerance, returning a blob URL of the result.",
  "frontend/src/hooks/useContactForm.ts": "Custom hook managing a contact form with validation that submits name, email, and message to the ICP backend actor via `addContactMessage`.",
  "frontend/src/hooks/useImageCompression.ts": "Custom hook that compresses an image file using canvas and returns a blob URL with original and compressed sizes; also exports a `loadImage` utility.",
  "frontend/src/hooks/useImageConversion.ts": "Custom hook that converts an image file to a specified format (JPEG, PNG, or WebP) using canvas, returning a blob URL and file size.",
  "frontend/src/hooks/useImageCrop.ts": "Custom hook that crops an image file to a specified area using canvas, returning a blob URL with the cropped dimensions.",
  "frontend/src/hooks/useImageMetadata.ts": "Custom hook that extracts metadata from an image file including dimensions, aspect ratio, file size, type, and last modified date.",
  "frontend/src/hooks/useImageResize.ts": "Custom hook that resizes an image to specified dimensions using canvas, with optional aspect ratio preservation, returning a blob URL.",
  "frontend/src/hooks/useImageRotation.ts": "Custom hook that rotates and/or flips an image by given degrees using canvas transformations, returning a blob URL of the result.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` component and `useInternetIdentity` hook for managing ICP Internet Identity authentication via `AuthClient`, exposing login status, identity, and login/clear actions.",
  "frontend/src/hooks/useJpgToPdf.ts": "React hook that converts one or more JPG/image files into a PDF by building a minimal PDF binary manually using canvas-rendered image data.",
  "frontend/src/hooks/usePageTracking.ts": "React hook that tracks page/tool visits by calling the backend `updateAnalytics` actor method with the current date and tool name.",
  "frontend/src/hooks/usePdfCompression.ts": "React hook stub for PDF compression that currently passes the original file through unchanged due to the absence of pdf-lib.",
  "frontend/src/hooks/usePdfLock.ts": "React hook stub for password-locking a PDF that passes the file through unchanged since pdf-lib encryption is not available.",
  "frontend/src/hooks/usePdfMerge.ts": "React hook for merging multiple PDFs that currently returns only the first file as a placeholder because pdf-lib is not installed.",
  "frontend/src/hooks/usePdfPageNumbers.ts": "React hook stub for adding page numbers to a PDF that passes the original file through unchanged without pdf-lib.",
  "frontend/src/hooks/usePdfSplit.ts": "React hook stub for splitting a PDF by page ranges that returns the original file unchanged due to missing pdf-lib dependency.",
  "frontend/src/hooks/usePdfToJpg.ts": "React hook that converts each page of a PDF to a JPEG image by dynamically loading PDF.js from a CDN and rendering pages to canvas elements.",
  "frontend/src/hooks/usePdfToWord.ts": "React hook that extracts text from a PDF using dynamically loaded PDF.js and outputs it as a plain-text file with per-page labels.",
  "frontend/src/hooks/usePdfUnlock.ts": "React hook stub for unlocking a password-protected PDF that passes the file through unchanged without actual decryption support.",
  "frontend/src/hooks/usePdfWatermark.ts": "React hook stub for adding a text watermark to a PDF that passes the original file through unchanged due to missing pdf-lib.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for analytics, blog posts, and contact messages, wrapping backend actor calls with useQuery and useMutation.",
  "frontend/src/hooks/useWordToPdf.ts": "React hook that converts plain text to a multi-page PDF by manually constructing a minimal PDF binary with word-wrapped lines and Helvetica font.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Space Grotesk fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for the dark theme color system, and provides utility classes for gradients, card hover effects, upload zones, and scrollbars.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing ToolsHub Free's mission, features (speed, privacy, free access), story, and stats, with SEO metadata and page tracking.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page showing analytics charts and stat cards, with tabs for settings including a form to change the admin username using the current password for verification.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page with username/password form that authenticates via the AuthContext and redirects to the dashboard on success, showing inline error messages on failure.",
  "frontend/src/pages/BlogArticlePage.tsx": "Dynamic blog article page that looks up a post by slug, renders its markdown-like content with custom parsing, displays related tools, and includes structured schema markup and ad banners.",
  "frontend/src/pages/BlogIndexPage.tsx": "Blog listing page that displays all seed blog posts with category tab filtering, an ad banner, and card links to individual articles.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with name, email, and message fields, submission handling via useContactForm hook, success/error states, and SEO metadata.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static Disclaimer page outlining tool accuracy limitations, liability, and indemnification terms, with SEO metadata and page tracking.",
  "frontend/src/pages/HomePage.tsx": "The main landing page displaying a hero section, search input, and tabbed grid of image/PDF tools with inline ad banners inserted every 5 items. Includes structured WebSite schema and page tracking.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page detailing data collection, cookie usage, third-party services (AdSense, Analytics), and client-side file processing practices, with SEO metadata and page tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page covering acceptable use, intellectual property, disclaimers, and liability limitations, with SEO metadata and page tracking.",
  "frontend/src/pages/tools/BackgroundRemoverPage.tsx": "Tool page for removing image backgrounds using a configurable color picker and tolerance slider, displaying before/after previews and a download button for the processed PNG.",
  "frontend/src/pages/tools/ImageCompressorPage.tsx": "Page component for compressing images with an adjustable quality slider, displaying original vs compressed size stats and a download link for the result.",
  "frontend/src/pages/tools/ImageCropperPage.tsx": "Page component for cropping images by specifying X, Y, width, and height pixel values via numeric inputs, then downloading the cropped result.",
  "frontend/src/pages/tools/ImageMetadataViewerPage.tsx": "Page component that extracts and displays image metadata (file name, size, type, dimensions, aspect ratio, last modified) upon file upload.",
  "frontend/src/pages/tools/ImageResizerPage.tsx": "Page component for resizing images to specified pixel dimensions with an optional aspect-ratio lock, providing a download link for the resized output.",
  "frontend/src/pages/tools/ImageRotatorPage.tsx": "Page component for rotating images by 90°, 180°, or 270° and flipping horizontally or vertically, with a live preview and download option.",
  "frontend/src/pages/tools/ImageToWebpPage.tsx": "Page component that converts uploaded images to WebP format with a configurable quality slider and provides a download link for the converted file.",
  "frontend/src/pages/tools/JpgToPdfPage.tsx": "Page component that accepts multiple image files and converts them into a single downloadable PDF using the useJpgToPdf hook.",
  "frontend/src/pages/tools/JpgToPngPage.tsx": "A page component that allows users to upload a JPG/JPEG image, preview it, convert it to PNG using the useImageConversion hook, and download the result.",
  "frontend/src/pages/tools/PdfCompressorPage.tsx": "A page component that lets users upload a PDF, compress it via the usePdfCompression hook, and download the compressed file while showing original vs. compressed size.",
  "frontend/src/pages/tools/PdfLockPage.tsx": "A page component that enables users to upload a PDF, enter a password, and lock/password-protect it using the usePdfLock hook, then download the locked file.",
  "frontend/src/pages/tools/PdfMergePage.tsx": "A page component that accepts multiple PDF uploads and merges them into a single PDF using the usePdfMerge hook, then provides a download link.",
  "frontend/src/pages/tools/PdfPageNumbersPage.tsx": "A page component that allows users to upload a PDF and add page numbers at a configurable position and starting number using the usePdfPageNumbers hook.",
  "frontend/src/pages/tools/PdfSplitPage.tsx": "A page component that lets users upload a PDF, specify page ranges, and split it into multiple PDFs using the usePdfSplit hook, with individual download links for each result.",
  "frontend/src/pages/tools/PdfToJpgPage.tsx": "A page component that converts each page of an uploaded PDF to a JPG image using the usePdfToJpg hook, showing a progress bar during conversion and a grid of downloadable page images.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "React page for extracting text from a PDF file, displaying a preview of the extracted text, and downloading it as a .txt file using the usePdfToWord hook.",
  "frontend/src/pages/tools/PdfUnlockPage.tsx": "React page that allows users to upload a password-protected PDF, enter its password, unlock it via the usePdfUnlock hook, and download the unlocked file.",
  "frontend/src/pages/tools/PdfWatermarkPage.tsx": "React page for adding a customizable text watermark (text, opacity, font size, position) to a PDF using the usePdfWatermark hook.",
  "frontend/src/pages/tools/PngToJpgPage.tsx": "React page that converts an uploaded PNG image to JPG at a user-selected quality level using the useImageConversion hook, with preview and download support.",
  "frontend/src/pages/tools/WebpToJpgPage.tsx": "React page that converts an uploaded WebP image to JPG at a configurable quality level using the useImageConversion hook, with preview and download support.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "React page that accepts pasted or typed text and converts it to a downloadable PDF using the useWordToPdf hook.",
  "frontend/src/utils/seedBlogPosts.ts": "Defines the SeedBlogPost interface and exports an array of seed blog post objects covering topics like image compression and PDF tools, including content, metadata, and related tool references.",
  "frontend/src/utils/seoData.ts": "Defines the SEOData interface and exports pre-configured SEO metadata objects (title, description, keywords, ogImage) for each static page including home, blog, about, contact, privacy, disclaimer, and terms.",
  "frontend/src/utils/toolsData.ts": "Defines the ToolData interface and exports arrays of image and PDF tool configurations, each containing id, name, description, route, category, keywords, related tools, FAQ entries, and meta SEO fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts (Inter, Space Grotesk), an extended color palette using oklch CSS variables, custom border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state at version 7, documenting the tech stack, architectural notes, existing features, and requirements for a production-ready image and PDF tools website with AdSense, admin panel, SEO, and blog."
}