{
  "backend/main.mo": "Motoko actor defining data types and methods for contact messages, daily analytics (visitor counts and tool usage), and blog posts with date-sorted querying.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (UI, image tools, PDF tools) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of all frontend source files, covering hooks, pages, and components across the app.",
  "frontend/index.css": "Tailwind CSS entry file defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the React app, titled 'Free Online Image & PDF Tools'.",
  "frontend/src/App.tsx": "Root React app file that sets up TanStack Router with lazy-loaded routes for all tool pages, legal pages, blog, and admin panel, wrapped in AuthProvider with Header, Footer, and ad components.",
  "frontend/src/components/ads/AdBanner.tsx": "Reusable ad banner placeholder component that renders a sized div with an advertisement label, intended for Google AdSense integration.",
  "frontend/src/components/ads/PopupAd.tsx": "Popup ad component that appears after a 5-second delay with a dismissible overlay, containing a 300×250 AdSense placeholder.",
  "frontend/src/components/ads/StickyBottomAd.tsx": "Fixed bottom banner ad component showing a 728×60 AdSense placeholder with a close button to dismiss it.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links for tools, company pages, and resources, plus hashtags, a copyright notice, and an AdSense placeholder.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop nav links, a leaderboard ad banner, and a collapsible mobile menu.",
  "frontend/src/components/seo/Breadcrumb.tsx": "Renders an accessible breadcrumb trail from a list of items, prepending a Home link with a home icon.",
  "frontend/src/components/seo/FAQSection.tsx": "Displays a collapsible FAQ accordion section from an array of question/answer pairs using the Accordion UI component.",
  "frontend/src/components/seo/SEOHead.tsx": "Imperatively sets document title, meta tags (description, keywords, Open Graph, Twitter Card), canonical link, and JSON-LD schema scripts via React effects.",
  "frontend/src/components/tools/ImageToolTemplate.tsx": "Page layout template for image tools that wires up SEO head, breadcrumb, FAQ, related tools sidebar, and ad banners around the tool's child UI.",
  "frontend/src/components/tools/MultiFileUploadZone.tsx": "Drag-and-drop / click-to-browse upload zone supporting multiple files with a file list display and individual file removal.",
  "frontend/src/components/tools/PdfToolTemplate.tsx": "Page layout template for PDF tools, identical in structure to ImageToolTemplate but uses 'BusinessApplication' schema category.",
  "frontend/src/components/tools/RelatedTools.tsx": "Renders a grid of related tool cards with icon, name, description, and a link arrow, hidden when the tools array is empty.",
  "frontend/src/components/tools/ToolUploadZone.tsx": "A drag-and-drop file upload zone component that accepts a single file, shows appropriate icons for image or PDF types, and triggers a callback on file selection.",
  "frontend/src/contexts/AuthContext.tsx": "Provides a simple admin authentication context with hardcoded credentials, persisting auth state in sessionStorage and exposing login/logout functions.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (anonymous or authenticated) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackgroundRemoval.ts": "A hook that removes a specified background color from an image using canvas pixel manipulation with a configurable color tolerance, returning a PNG blob URL.",
  "frontend/src/hooks/useContactForm.ts": "A hook managing contact form state, validation, and submission via the ICP backend actor's addContactMessage method.",
  "frontend/src/hooks/useImageCompression.ts": "A hook that compresses an image file to a canvas blob at a given quality level, returning the result URL and size comparison. Also exports a loadImage utility.",
  "frontend/src/hooks/useImageConversion.ts": "A hook that converts an image file to a target format (JPEG, PNG, or WebP) using canvas, returning the converted blob URL and file size.",
  "frontend/src/hooks/useImageCrop.ts": "A hook that crops an image to a specified rectangular area using canvas, returning the cropped blob URL and dimensions.",
  "frontend/src/hooks/useImageMetadata.ts": "A hook that extracts metadata from an image file including dimensions, aspect ratio, file size, type, and last modified date.",
  "frontend/src/hooks/useImageResize.ts": "A hook that resizes an image to specified dimensions using canvas, with optional aspect ratio preservation, returning the resized blob URL and dimensions.",
  "frontend/src/hooks/useImageRotation.ts": "A hook that rotates and/or flips an image by given degrees using canvas transforms, returning the resulting blob URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login state, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useJpgToPdf.ts": "Custom React hook that converts one or more JPG/image files into a PDF by building a minimal PDF binary manually using canvas-rendered image data.",
  "frontend/src/hooks/usePageTracking.ts": "Custom React hook that tracks page/tool visits by calling the backend `updateAnalytics` actor method with the current date and tool name.",
  "frontend/src/hooks/usePdfCompression.ts": "Custom React hook stub for PDF compression that currently passes the file through unchanged due to the absence of pdf-lib.",
  "frontend/src/hooks/usePdfLock.ts": "Custom React hook stub for password-locking a PDF that passes the file through unchanged since pdf-lib encryption is unavailable.",
  "frontend/src/hooks/usePdfMerge.ts": "Custom React hook for merging multiple PDFs that currently returns only the first file as a placeholder, as real merging requires pdf-lib.",
  "frontend/src/hooks/usePdfPageNumbers.ts": "Custom React hook stub for adding page numbers to a PDF that passes the file through unchanged due to missing pdf-lib support.",
  "frontend/src/hooks/usePdfSplit.ts": "Custom React hook stub for splitting a PDF by page ranges that returns the original file unchanged since pdf-lib is not available.",
  "frontend/src/hooks/usePdfToJpg.ts": "Custom React hook that converts each page of a PDF to a JPEG image by dynamically loading PDF.js from a CDN and rendering pages to canvas.",
  "frontend/src/hooks/usePdfToWord.ts": "Custom React hook that extracts text from a PDF using dynamically loaded PDF.js and outputs it as a plain-text file formatted by page.",
  "frontend/src/hooks/usePdfUnlock.ts": "Custom React hook stub for unlocking a password-protected PDF that currently passes the file through unchanged.",
  "frontend/src/hooks/usePdfWatermark.ts": "Custom React hook stub for adding a text watermark to a PDF that passes the file through unchanged due to missing pdf-lib support.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for analytics, blog posts, and contact messages, wrapping backend actor calls with `useQuery` and `useMutation`.",
  "frontend/src/hooks/useWordToPdf.ts": "Custom React hook that converts plain text to a multi-page PDF by building a minimal PDF binary with word-wrapped lines and a Helvetica font.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Space Grotesk fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for the dark theme color system, and provides utility classes for gradients, card hover effects, upload zones, and scrollbars.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing ToolsHub Free's mission, features (speed, privacy, free access), story, and stats, with SEO metadata and page tracking.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Protected admin dashboard showing 7-day visitor analytics, tool usage stats, and a bar chart using Recharts, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form with username/password fields, show/hide password toggle, error display, and redirect to dashboard on successful authentication.",
  "frontend/src/pages/BlogArticlePage.tsx": "Dynamic blog article page that looks up a post by slug, renders its markdown-like content with custom parsing, displays related tools, and includes structured schema markup and ad banners.",
  "frontend/src/pages/BlogIndexPage.tsx": "Blog listing page that displays all seed blog posts in a card grid with category tab filtering, SEO metadata, schema markup, and an ad banner.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with name, email, and message fields, using the useContactForm hook for submission state management, and showing a success confirmation on completion.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static Disclaimer page outlining limitations of tool accuracy, file processing, liability, and indemnification, with SEO metadata and page tracking.",
  "frontend/src/pages/HomePage.tsx": "The main landing page displaying a hero section, searchable tool grid (image and PDF tools), and inline ad banners, with SEO metadata and page tracking.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page explaining data collection, cookie usage, third-party services (AdSense/Analytics), and client-side file processing, with SEO head and page tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page covering acceptable use, intellectual property, disclaimers, and liability, with SEO head and page tracking.",
  "frontend/src/pages/tools/BackgroundRemoverPage.tsx": "Image tool page that lets users upload an image, select a background color and tolerance, remove the background client-side, and download the resulting PNG.",
  "frontend/src/pages/tools/ImageCompressorPage.tsx": "Page component for compressing images with an adjustable quality slider, displaying original vs compressed size stats and a download link for the result.",
  "frontend/src/pages/tools/ImageCropperPage.tsx": "Page component for cropping images by specifying X, Y, width, and height pixel values via numeric inputs, then downloading the cropped result.",
  "frontend/src/pages/tools/ImageMetadataViewerPage.tsx": "Page component that extracts and displays image metadata (file name, size, type, dimensions, aspect ratio, last modified) upon file upload.",
  "frontend/src/pages/tools/ImageResizerPage.tsx": "Page component for resizing images to specified pixel dimensions with an optional aspect-ratio lock, providing a download link for the resized output.",
  "frontend/src/pages/tools/ImageRotatorPage.tsx": "Page component for rotating images by 90°, 180°, or 270° and flipping horizontally or vertically, with a live preview and download option.",
  "frontend/src/pages/tools/ImageToWebpPage.tsx": "Page component that converts uploaded images to WebP format at a user-selected quality level and provides a download link for the converted file.",
  "frontend/src/pages/tools/JpgToPdfPage.tsx": "Page component that accepts multiple image files and converts them into a single downloadable PDF using the useJpgToPdf hook.",
  "frontend/src/pages/tools/JpgToPngPage.tsx": "A page component that allows users to upload a JPG/JPEG image, preview it, convert it to PNG using the useImageConversion hook, and download the result.",
  "frontend/src/pages/tools/PdfCompressorPage.tsx": "A page component that lets users upload a PDF, compress it via the usePdfCompression hook, and download the compressed file while showing original vs. compressed size.",
  "frontend/src/pages/tools/PdfLockPage.tsx": "A page component that enables users to upload a PDF, enter a password with a show/hide toggle, lock the PDF using the usePdfLock hook, and download the password-protected file.",
  "frontend/src/pages/tools/PdfMergePage.tsx": "A page component that accepts multiple PDF uploads and merges them into a single PDF using the usePdfMerge hook, then provides a download link for the merged result.",
  "frontend/src/pages/tools/PdfPageNumbersPage.tsx": "A page component that lets users upload a PDF and add page numbers at a configurable position and starting number using the usePdfPageNumbers hook, then download the numbered PDF.",
  "frontend/src/pages/tools/PdfSplitPage.tsx": "A page component that allows users to upload a PDF, specify comma-separated page ranges, split the PDF into multiple files using the usePdfSplit hook, and download each resulting segment.",
  "frontend/src/pages/tools/PdfToJpgPage.tsx": "A page component that converts each page of an uploaded PDF to a JPG image using the usePdfToJpg hook, displaying a progress bar during conversion and individual download links for each page.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "React page for extracting text from a PDF file, displaying a preview of the extracted text, and downloading the result as a .txt file.",
  "frontend/src/pages/tools/PdfUnlockPage.tsx": "React page that allows users to upload a password-protected PDF, enter its password, and download the unlocked version.",
  "frontend/src/pages/tools/PdfWatermarkPage.tsx": "React page for adding a customizable text watermark (text, opacity, font size, position) to an uploaded PDF and downloading the result.",
  "frontend/src/pages/tools/PngToJpgPage.tsx": "React page that converts an uploaded PNG image to JPG with an adjustable quality slider and provides a download link for the result.",
  "frontend/src/pages/tools/WebpToJpgPage.tsx": "React page that converts an uploaded WebP image to JPG with an adjustable quality slider and provides a download link for the result.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "React page that converts user-entered or pasted text into a PDF document and provides a download link for the generated file.",
  "frontend/src/utils/seedBlogPosts.ts": "Defines the SeedBlogPost interface and exports an array of seed blog post objects covering topics like image compression and PDF tools, including content, metadata, and related tool references.",
  "frontend/src/utils/seoData.ts": "Defines the SEOData interface and exports pre-configured SEO metadata objects (title, description, keywords, ogImage) for each static page including home, blog, about, contact, privacy, disclaimer, and terms.",
  "frontend/src/utils/toolsData.ts": "Defines the ToolData interface and exports arrays of image and PDF tool metadata including routes, categories, keywords, FAQs, related tools, and meta tags for all 20+ tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom design tokens (colors using oklch, fonts, border radii, shadows, gradients), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state at version 3, documenting architectural decisions, existing implemented features, known issues, image requirements, and tech stack for a production-ready image and PDF tools website."
}