{
  "backend/main.mo": "Motoko actor defining the backend with types and methods for contact messages, daily analytics (visitor counts and tool usage), and blog posts (add, filter by category, sort by date).",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—updating hardcoded admin credentials and adding a settings section to the admin dashboard—to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering tool pages, hooks, context, admin pages, blog pages, and legal pages.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme design tokens (colors, radius, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with a root div and a module script tag loading the React app entry point.",
  "frontend/src/App.tsx": "Main React app file that sets up TanStack Router with lazy-loaded routes for all tool, blog, legal, and admin pages, wrapped in AuthProvider with shared Header, Footer, and ad components.",
  "frontend/src/components/ads/AdBanner.tsx": "Reusable ad banner placeholder component that renders a styled div with configurable width, height, and label for future Google AdSense integration.",
  "frontend/src/components/ads/PopupAd.tsx": "Popup ad component that appears after a 5-second delay with a dismissible overlay, containing a 300×250 AdSense placeholder.",
  "frontend/src/components/ads/StickyBottomAd.tsx": "Fixed bottom sticky ad bar with a 728×60 AdSense placeholder and a close button to dismiss it.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand info, popular tool links, legal/company links, resources links, SEO hashtags, and a copyright bar.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with logo, desktop nav links, and a collapsible mobile menu, plus a leaderboard AdBanner above the nav.",
  "frontend/src/components/seo/Breadcrumb.tsx": "Renders an accessible breadcrumb trail from a list of items, prepending a Home link with a home icon.",
  "frontend/src/components/seo/FAQSection.tsx": "Displays a collapsible FAQ accordion section from an array of question/answer pairs using the Accordion UI component.",
  "frontend/src/components/seo/SEOHead.tsx": "Imperatively sets document title, meta tags (Open Graph, Twitter), canonical link, and JSON-LD schema scripts via React effects.",
  "frontend/src/components/tools/ImageToolTemplate.tsx": "Page layout template for image tools that wires up SEO, breadcrumbs, structured schema, ad banners, FAQ, and related tools around a child tool UI.",
  "frontend/src/components/tools/MultiFileUploadZone.tsx": "Drag-and-drop upload zone supporting multiple file selection with a file list display and per-file removal, capped at a configurable max.",
  "frontend/src/components/tools/PdfToolTemplate.tsx": "Page layout template for PDF tools, identical in structure to ImageToolTemplate but categorizes the schema as a BusinessApplication.",
  "frontend/src/components/tools/RelatedTools.tsx": "Renders a grid of linked cards for related tools, each showing icon, name, and description.",
  "frontend/src/components/tools/ToolUploadZone.tsx": "Single-file drag-and-drop upload zone with icon, label, and sublabel, supporting both image and PDF accept types.",
  "frontend/src/contexts/AuthContext.tsx": "Provides session-based authentication context with login, logout, and credential-change functionality, persisting state in sessionStorage.",
  "frontend/src/hooks/useActor.ts": "Provides a `useActor` hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBackgroundRemoval.ts": "Provides a `useBackgroundRemoval` hook that removes a solid background color from an image using canvas pixel manipulation based on a hex color and tolerance threshold.",
  "frontend/src/hooks/useContactForm.ts": "Provides a `useContactForm` hook that manages contact form state, validates inputs, and submits the message to the backend actor via `addContactMessage`.",
  "frontend/src/hooks/useImageCompression.ts": "Provides a `useImageCompression` hook that compresses an image file via canvas at a given quality level, and exports a `loadImage` utility for loading a File into an HTMLImageElement.",
  "frontend/src/hooks/useImageConversion.ts": "Provides a `useImageConversion` hook that converts an image file to a specified MIME format (JPEG, PNG, or WebP) using canvas, with optional quality control.",
  "frontend/src/hooks/useImageCrop.ts": "Provides a `useImageCrop` hook that crops an image file to a specified rectangular area using canvas and returns a blob URL of the result.",
  "frontend/src/hooks/useImageMetadata.ts": "Provides a `useImageMetadata` hook that extracts metadata from an image file including dimensions, aspect ratio, file size, type, and last modified date.",
  "frontend/src/hooks/useImageResize.ts": "Provides a `useImageResize` hook that resizes an image file to specified dimensions using canvas, with optional aspect ratio preservation.",
  "frontend/src/hooks/useImageRotation.ts": "Provides a `useImageRotation` hook that rotates and/or flips an image file by arbitrary degrees using canvas transformations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via `AuthClient`, exposing a React context provider and `useInternetIdentity` hook with login, logout, and identity state management.",
  "frontend/src/hooks/useJpgToPdf.ts": "Provides a `useJpgToPdf` hook that converts one or more image files into a minimal PDF by manually constructing the PDF binary structure with embedded JPEG XObjects.",
  "frontend/src/hooks/usePageTracking.ts": "Custom hook that fires an analytics update to the backend actor on mount, recording the current date and tool name (defaulting to 'homepage').",
  "frontend/src/hooks/usePdfCompression.ts": "Hook that simulates PDF compression by passing the file through unchanged (no pdf-lib), returning a blob URL with original and 'compressed' sizes.",
  "frontend/src/hooks/usePdfLock.ts": "Hook that simulates PDF password-locking by passing the file through unchanged, as actual encryption requires pdf-lib.",
  "frontend/src/hooks/usePdfMerge.ts": "Hook that attempts to merge multiple PDF files but currently returns only the first file as a placeholder since pdf-lib is not available.",
  "frontend/src/hooks/usePdfPageNumbers.ts": "Hook that simulates adding page numbers to a PDF by passing the file through unchanged due to missing pdf-lib dependency.",
  "frontend/src/hooks/usePdfSplit.ts": "Hook that simulates PDF splitting by returning the original file unchanged, noting that real splitting requires pdf-lib.",
  "frontend/src/hooks/usePdfToJpg.ts": "Hook that converts each page of a PDF to a JPEG image using PDF.js loaded dynamically from a CDN, tracking per-page progress.",
  "frontend/src/hooks/usePdfToWord.ts": "Hook that extracts text from a PDF using dynamically loaded PDF.js and returns it as a plain-text blob, labeled per page.",
  "frontend/src/hooks/usePdfUnlock.ts": "Hook that simulates PDF unlocking by passing the file through unchanged, as actual decryption is not implemented.",
  "frontend/src/hooks/usePdfWatermark.ts": "Hook that simulates adding a text watermark to a PDF by passing the file through unchanged due to missing pdf-lib dependency.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for analytics (single/multi-day), blog posts (list/category/add), and contact messages, all using the backend actor.",
  "frontend/src/hooks/useWordToPdf.ts": "Hook that converts plain text to a minimal valid PDF built from scratch using raw PDF syntax, handling multi-page layout and line wrapping.",
  "frontend/src/index.css": "Global stylesheet importing Inter and Space Grotesk fonts, defining Tailwind base/component/utility layers, CSS custom properties for a dark theme, and utility classes for gradients, card hover effects, upload zones, and scrollbars.",
  "frontend/src/main.tsx": "Entry point that bootstraps the React app with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing ToolsHub Free's mission, features, and stats, with SEO metadata and page tracking.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page displaying analytics stats via charts and stat cards, with a settings tab that allows changing admin username and password using the AuthContext.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page with username/password form that authenticates via AuthContext and redirects to the dashboard on success.",
  "frontend/src/pages/BlogArticlePage.tsx": "Dynamic blog article page that renders a single post by slug with basic markdown parsing, related tools, structured data, and ads.",
  "frontend/src/pages/BlogIndexPage.tsx": "Blog listing page showing all seed blog posts with category tab filtering, SEO metadata, and an ad banner.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page using a custom hook for form state and submission, with success/error feedback and SEO metadata.",
  "frontend/src/pages/DisclaimerPage.tsx": "Static Disclaimer page outlining tool accuracy, liability limitations, and usage terms with SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section, searchable tool grid for image and PDF tools with inline ads, and structured schema data.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page with SEO metadata and page tracking, covering data collection, cookies, third-party services (Google AdSense/Analytics), and contact information.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with SEO metadata and page tracking, covering acceptable use, intellectual property, disclaimers, and liability limitations.",
  "frontend/src/pages/tools/BackgroundRemoverPage.tsx": "Tool page for removing image backgrounds client-side, allowing users to select a background color and tolerance, preview the result, and download the processed PNG.",
  "frontend/src/pages/tools/ImageCompressorPage.tsx": "Tool page for compressing images client-side with an adjustable quality slider, showing original vs. compressed file sizes and providing a download link for the result.",
  "frontend/src/pages/tools/ImageCropperPage.tsx": "Page component for cropping images, allowing users to upload an image, specify crop coordinates and dimensions via inputs, and download the cropped result.",
  "frontend/src/pages/tools/ImageMetadataViewerPage.tsx": "Page component that extracts and displays metadata (file name, size, type, dimensions, aspect ratio, last modified) from an uploaded image.",
  "frontend/src/pages/tools/ImageResizerPage.tsx": "Page component for resizing images, with width/height inputs, optional aspect ratio lock, and a download button for the resized output.",
  "frontend/src/pages/tools/ImageRotatorPage.tsx": "Page component for rotating or flipping an uploaded image with preset buttons (90°, 180°, 270° CW, flip horizontal/vertical) and a download option.",
  "frontend/src/pages/tools/ImageToWebpPage.tsx": "Page component that converts an uploaded image to WebP format with an adjustable quality slider and provides a download link for the result.",
  "frontend/src/pages/tools/JpgToPdfPage.tsx": "Page component that accepts multiple image files and converts them into a single downloadable PDF using the useJpgToPdf hook.",
  "frontend/src/pages/tools/JpgToPngPage.tsx": "Page component that converts an uploaded JPG/JPEG image to PNG format and provides a download link for the converted file.",
  "frontend/src/pages/tools/PdfCompressorPage.tsx": "Page component for compressing PDF files, allowing users to upload a PDF, trigger compression, view original vs compressed size, and download the result.",
  "frontend/src/pages/tools/PdfLockPage.tsx": "Page component for password-protecting a PDF, providing a file upload zone, a password input with show/hide toggle, and a download link for the locked PDF.",
  "frontend/src/pages/tools/PdfMergePage.tsx": "Page component for merging multiple PDF files into one, using a multi-file upload zone and providing a download link for the merged output.",
  "frontend/src/pages/tools/PdfPageNumbersPage.tsx": "Page component for adding page numbers to a PDF, with configurable position and starting number options, and a download link for the numbered PDF.",
  "frontend/src/pages/tools/PdfSplitPage.tsx": "Page component for splitting a PDF into multiple files by user-defined page ranges, displaying individual download links for each resulting PDF segment.",
  "frontend/src/pages/tools/PdfToJpgPage.tsx": "Page component for converting each page of a PDF to JPG images, showing a progress bar during conversion and a grid of image previews with per-page download links.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Page component for extracting text from a PDF, displaying a preview of the extracted content and offering a download link for the resulting text file.",
  "frontend/src/pages/tools/PdfUnlockPage.tsx": "React page for unlocking password-protected PDFs, allowing users to upload a PDF, enter a password, and download the unlocked result.",
  "frontend/src/pages/tools/PdfWatermarkPage.tsx": "React page for adding customizable text watermarks to PDFs, with controls for text, position, opacity, and font size.",
  "frontend/src/pages/tools/PngToJpgPage.tsx": "React page for converting PNG images to JPG format with an adjustable quality slider and preview.",
  "frontend/src/pages/tools/WebpToJpgPage.tsx": "React page for converting WebP images to JPG format with an adjustable quality slider and preview.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "React page that converts pasted or typed text content into a downloadable PDF file.",
  "frontend/src/utils/seedBlogPosts.ts": "Defines the SeedBlogPost interface and exports an array of static seed blog posts covering topics like image compression and PDF tools.",
  "frontend/src/utils/seoData.ts": "Defines the SEOData interface and exports static SEO metadata objects (title, description, keywords, ogImage) for each major page of the site.",
  "frontend/src/utils/toolsData.ts": "Defines the `ToolData` interface and exports arrays of image and PDF tool metadata including routes, categories, keywords, FAQs, related tools, and SEO meta fields for all 20+ tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom fonts (Inter, Space Grotesk), OKLCH-based color tokens, extended border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state (version 5) for a free online image/PDF tools site, documenting architectural notes, existing features, known issues, and requirements including admin panel, AdSense, SEO, and attribution to Anurag Singh."
}