{
  "kind": "build_request",
  "title": "Set admin credentials to AnuragSingh/Anurag@123 and add password change settings in admin dashboard",
  "projectName": "Free Online Tools",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Update the hardcoded admin credentials in `frontend/src/contexts/AuthContext.tsx` so that the default username is `AnuragSingh` and the default password is `Anurag@123`. These must be the credentials accepted on the `/admin/login` page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "make AnuragSingh as an username and Anurag@123 as a password"
        ]
      },
      "acceptanceCriteria": [
        "Logging in at /admin/login with username 'AnuragSingh' and password 'Anurag@123' succeeds and redirects to /admin dashboard.",
        "Logging in with any other username/password combination fails with an error message.",
        "The AuthContext default credentials are set to username='AnuragSingh' and password='Anurag@123'."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add a Settings section to the admin dashboard (`frontend/src/pages/admin/AdminDashboardPage.tsx`) that allows the logged-in admin to change their username and password. The settings form must have fields for: new username, current password (for verification), new password, and confirm new password. On successful save, the new credentials must replace the current ones in AuthContext state (and sessionStorage so they persist for the session). Display a success or error message after the attempt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "from where i can able to change?"
        ]
      },
      "acceptanceCriteria": [
        "A 'Settings' tab or section is visible in the admin dashboard after login.",
        "The settings form contains fields: new username, current password, new password, confirm new password.",
        "Submitting with a wrong current password shows a clear error message and does not update credentials.",
        "Submitting with mismatched new password and confirm password shows a validation error.",
        "On successful save, the updated username and password are applied immediately — logging out and logging in again with the new credentials works.",
        "A success notification is displayed after credentials are successfully changed."
      ]
    }
  ],
  "constraints": [
    "Do not modify any file under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Credentials are managed client-side in AuthContext and sessionStorage only — do not store passwords in the Motoko backend."
  ],
  "nonGoals": [
    "Persistent server-side credential storage across canister upgrades.",
    "Multi-user admin accounts.",
    "Email-based password reset flow.",
    "Any changes to the analytics dashboard data or chart logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}