{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Change Password to Admin Settings",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add a 'Change Password' form to the admin dashboard Settings section that validates the current password, accepts new password input, updates AuthContext state and sessionStorage on successful submission, and displays appropriate success or error messages styled with the dark gradient admin theme",
      "acceptanceCriteria": [
        "A 'Change Password' form is visible in the admin dashboard Settings section.",
        "The form has three fields: Current Password, New Password, and Confirm New Password.",
        "Submitting with the wrong current password shows an error message.",
        "Submitting with mismatched new password and confirm new password shows an error message.",
        "Submitting with all empty fields shows a validation error.",
        "On a valid submission, the password is updated in AuthContext state and sessionStorage.",
        "A success message is displayed after a successful password change.",
        "The admin can log out and log back in using the new password.",
        "The form and messages are styled consistently with the existing dark gradient admin theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a 'Change Password' subsection within the existing Settings tab. The subsection will include three controlled input fields (Current Password, New Password, Confirm New Password) with type='password', all styled consistently with the dark gradient admin theme. Implement form validation to check that all fields are filled, that the current password matches the stored credentials from AuthContext, and that the new password and confirm password fields match. On submit, if validation passes, call the changePassword method from AuthContext to update both the in-memory state and sessionStorage. Display a success message on successful update or a descriptive error message on validation failure (e.g., 'Current password is incorrect', 'New passwords do not match', 'All fields are required'). Ensure the form uses the same card styling, input styling, and button styling as the existing 'Change Username' form in the Settings section."
        }
      ]
    }
  ]
}